{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_2", "layers": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "mask_zero": false, "embeddings_regularizer": null, "output_dim": 32, "input_length": 100, "name": "embedding_2", "input_dim": 5000, "embeddings_constraint": null, "batch_input_shape": [null, 100], "dtype": "float32", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "sigmoid", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}, "backend": "tensorflow"}